In [1]:
#image

# Project Title
** Authors Celestine A. Imelda

## Overview 
The goal of this project is to analyze and derive insights from three datasets: bom.movie_gross.csv, title.akas.csv, and title.ratings.csv.The business problem at hand is to help a movie production company optimize their movie-making decisions and marketing strategies to maximize profitability and audience satisfaction.The project will begin with data cleaning and preprocessing to handle missing values, standardize titles, and merge relevant information from the three datasets. Based on the analysis, the project will provide key findings and actionable recommendations to the movie production company. By leveraging these insights, the movie production company can make data-driven decisions, improve movie quality, and enhance marketing efforts to boost financial success and audience satisfaction in a competitive film industry.

## Business Problem
**Business Problem**

The movie production company is facing several pain points related to optimizing their movie-making decisions and marketing strategies. They want to maximize profitability and audience satisfaction while minimizing the risk of investing in underperforming movies. 

The data analysis aligns with the company's objectives of maximizing profitability and audience satisfaction. They are designed to uncover insights that can influence decision-making, marketing strategies, and movie production practices.

## Data Understanding 
**Data Description**

The data used for this project comes from three datasets: `bom.movie_gross.csv`, `title.akas.csv`, and `title.ratings.csv`.

1. `bom.movie_gross.csv`:
   - Source: The dataset may have been obtained from Box Office Mojo or a similar movie revenue tracking platform.
   - Relevance: This dataset contains information about movie titles and their corresponding domestic and foreign gross revenues. It is crucial for answering questions related to factors contributing to a movie's box office success and revenue generation.

2. `title.akas.csv`:
   - Source: The dataset may have been sourced from IMDb's title registry or another database of movie titles and alternate titles.
   - Relevance: This dataset provides alternate titles and regional distribution information for movies. It is essential for understanding regional preferences in movie titles and how regional titles impact movie popularity and revenue.

3. `title.ratings.csv`:
   - Source: The dataset is likely sourced from IMDb or IMDb's API, containing movie ratings and vote counts.
   - Relevance: This dataset includes IMDb ratings and the number of votes for each movie title. It is vital for analyzing the correlation between IMDb ratings, audience satisfaction, and movie revenue.

Data Representation and Sample

- The data represents information on various movie titles and their performance metrics.
- The sample includes a collection of movies, each represented by a unique title or identifier.
- Variables included in the datasets are likely to include:
  - `bom.movie_gross.csv`: Movie title, domestic gross revenue, foreign gross revenue.
  - `title.akas.csv`: Movie title, alternate titles, region-specific titles.
  - `title.ratings.csv`: Movie title, IMDb rating, number of votes.

**Target Variable**

The target variable for this project is likely to be **"movie revenue"** or a revenue-related metric, such as **"total gross revenue"** (sum of domestic and foreign gross revenues). This variable will be used to assess a movie's financial success and box office performance.

**Properties of Variables**

- The variables related to revenue (domestic, foreign, or total gross) will likely be numeric and continuous.
- The average rating will be represented as a numeric variable with decimal points, reflecting the average audience rating for each movie.
- Movie titles will be represented as categorical variables, and region-specific titles may also be categorical.
Overall, the data provides a comprehensive representation of movie performance, ratings, and regional variations, enabling the analysis to answer the data questions and derive valuable insights for the movie production company's decision-making process.

In [1]:
import csv 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Exploring the data

In [2]:
data1 = pd.read_csv('bom.movie_gross.csv') #reading a csv file
data1.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [3]:
grouped_data1 = data1.groupby('studio')['title'].value_counts()
grouped_data1

studio  title
3D      Sea Rex 3D: Journey to a Prehistoric World    1
A23     Red Obsession                                 1
        Revenge of the Electric Car                   1
A24     20th Century Women                            1
        A Ghost Story                                 1
                                                     ..
Zeit.   The Pervert's Guide to Ideology               1
        The Salt of Life                              1
        The Tree                                      1
        Vision                                        1
        Zero Motivation                               1
Name: title, Length: 3382, dtype: int64

In [4]:
#checking the columns
data1.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [5]:
#checking the shape, gives us the numeber of rows and columns
data1.shape

(3387, 5)

In [6]:
#summary of the dataset above
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [7]:
data2 = pd.read_csv('title.akas.csv') #reading a csv file
data2.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [8]:
data2.info() #summary of the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [9]:
#reading the  third data set
data3 = pd.read_csv('title.ratings.csv') #reading a csv file
data3.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [10]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [11]:
data1.isnull().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [12]:
data2.isnull().sum() #finding missing values

title_id                  0
ordering                  0
title                     0
region                53293
language             289988
types                163256
attributes           316778
is_original_title        25
dtype: int64

In [13]:
#finding the sum of the null values in the data3
data3.isnull().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

## Data Preparation

## Data cleaning

For easier working on the datasets to achieve the desired results, i have decided to drop the columns and rows which have more than 80% of missing values and also those that were unnecessary.

In [14]:
data1.dropna(axis=0) #dropping the missing rows

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3275,I Still See You,LGF,1400.0,1500000,2018
3286,The Catcher Was a Spy,IFC,725000.0,229000,2018
3309,Time Freak,Grindstone,10000.0,256000,2018
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

In [29]:
data1.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [28]:
data1.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [37]:
# Calculate the mode of the 'foreign_gross' column
mode_replacement = data1['foreign_gross'].mode()[0]

# Fill missing values in the 'foreign_gross' column with the mode
data1_filled = data1.fillna({'foreign_gross': mode_replacement})

# Display the DataFrame after filling missing values
data1_filled

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,1200000,2018
3383,Edward II (2018 re-release),FM,4800.0,1200000,2018
3384,El Pacto,Sony,2500.0,1200000,2018
3385,The Swan,Synergetic,2400.0,1200000,2018
3386,An Actor Prepares,Grav.,1700.0,1200000,2018

In [39]:
data1_filled.isna().sum()

title              0
studio             5
domestic_gross    28
foreign_gross      0
year               0
dtype: int64

In [41]:
data1_filled.dropna(inplace=True)

In [43]:
data1_filled.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [15]:
data2.isna().sum()

title_id                  0
ordering                  0
title                     0
region                53293
language             289988
types                163256
attributes           316778
is_original_title        25
dtype: int64

In [20]:
data2.drop(['region','language', 'types', 'attributes'],axis=1,inplace=True)

In [21]:
data2.head()

,title_id,ordering,title,is_original_title
0,tt0369610,10,Джурасик свят,0.0
1,tt0369610,11,Jurashikku warudo,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,0.0
3,tt0369610,13,O Mundo dos Dinossauros,0.0
4,tt0369610,14,Jurassic World,0.0

## Merging Datasets

In [44]:
Merging_Dataset = pd.merge(data1_filled, data2, on='title')
Merging_Dataset

,title,studio,domestic_gross,foreign_gross,year,title_id,ordering,is_original_title
0,Toy Story 3,BV,415000000.0,652000000,2010,tt0435761,15,0.0
1,Toy Story 3,BV,415000000.0,652000000,2010,tt0435761,20,0.0
2,Toy Story 3,BV,415000000.0,652000000,2010,tt0435761,21,0.0
3,Toy Story 3,BV,415000000.0,652000000,2010,tt0435761,22,0.0
4,Toy Story 3,BV,415000000.0,652000000,2010,tt0435761,27,1.0
...,...,...,...,...,...,...,...,...
10837,El Pacto,Sony,2500.0,1200000,2018,tt2040560,8,0.0
10838,The Swan,Synergetic,2400.0,1200000,2018,tt5764816,1,0.0
10839,The Swan,Synergetic,2400.0,1200000,2018,tt5764816,4,0.0
10840,An Actor Prepares,Grav.,1700.0,1200000,2018,tt5718046,1,1.0
10841,An Actor Prepares,Grav.,1700.0,1200000,2018,tt5718046,6,0.0

In [55]:
# Create the 'total_gross_revenue' column by summing 'domestic_gross' and 'foreign_gross'
# Convert 'foreign_gross' column to numeric data type


# Calculate the total gross revenue by adding the 'domestic_gross' and 'foreign_gross' columns
Merging_Dataset['total_gross_revenue'] = Merging_Dataset['domestic_gross'] + Merging_Dataset['foreign_gross']

# Display the DataFrame with the added columns
Merging_Dataset

,title,studio,domestic_gross,foreign_gross,year,title_id,ordering,is_original_title,total_gross_revenue
0,Toy Story 3,BV,415000000.0,652000000.0,2010,tt0435761,15,0.0,1.067000e+09
1,Toy Story 3,BV,415000000.0,652000000.0,2010,tt0435761,20,0.0,1.067000e+09
2,Toy Story 3,BV,415000000.0,652000000.0,2010,tt0435761,21,0.0,1.067000e+09
3,Toy Story 3,BV,415000000.0,652000000.0,2010,tt0435761,22,0.0,1.067000e+09
4,Toy Story 3,BV,415000000.0,652000000.0,2010,tt0435761,27,1.0,1.067000e+09
...,...,...,...,...,...,...,...,...,...
10837,El Pacto,Sony,2500.0,1200000.0,2018,tt2040560,8,0.0,1.202500e+06
10838,The Swan,Synergetic,2400.0,1200000.0,2018,tt5764816,1,0.0,1.202400e+06
10839,The Swan,Synergetic,2400.0,1200000.0,2018,tt5764816,4,0.0,1.202400e+06
10840,An Actor Prepares,Grav.,1700.0,1200000.0,2018,tt5718046,1,1.0,1.201700e+06
10841,An Actor Prepares,Grav.,1700.0,1200000.0,2018,tt5718046,6,0.0,1.201700e+06

In [50]:
Merging_Dataset['total_gross_revenue']

0        1.067000e+09
1        1.067000e+09
2        1.067000e+09
3        1.067000e+09
4        1.067000e+09
             ...
10837    1.202500e+06
10838    1.202400e+06
10839    1.202400e+06
10840    1.201700e+06
10841    1.201700e+06
Name: total_gross_revenue, Length: 10842, dtype: float64

In [56]:
pd.options.display.float_format = '{:.2f}'.format

In [57]:
Merging_Dataset['total_gross_revenue']

0       1067000000.00
1       1067000000.00
2       1067000000.00
3       1067000000.00
4       1067000000.00
             ...
10837      1202500.00
10838      1202400.00
10839      1202400.00
10840      1201700.00
10841      1201700.00
Name: total_gross_revenue, Length: 10842, dtype: float64

## Data Preparation
**Data Preparation Process**

1. **Data Cleaning:**
   - **Handling Missing Values:** Depending on the extent of missing values in each dataset, we will decide how to address them. We may choose to drop rows with missing essential information or impute missing values using appropriate methods (e.g., mean, median, or interpolation) if the missing values are relatively few and don't introduce significant bias.
   - **Handling Duplicates:** Check for and remove any duplicate rows, if present in the datasets.
   - **Standardizing Titles:** To ensure consistency in movie titles across datasets, we may convert titles to a common format (e.g., all lowercase) and handle any discrepancies in alternate titles or regional titles.

2. **Feature Engineering:**
   - **Combining Information:** We may merge relevant information from different datasets based on common keys (e.g., movie title) to create a unified dataset containing all necessary attributes for analysis.
   - **Creating Revenue Metrics:** If not already available, we may calculate additional revenue-related metrics, such as "total revenue" by summing domestic and foreign gross revenues.

3. **Outlier Handling:**
   - **Detecting Outliers:** We will use visualization techniques, such as box plots or scatter plots, to identify potential outliers in revenue, ratings, or other relevant variables.
   - **Outlier Treatment:** Depending on the nature of the outliers and their impact on analysis, we may choose to handle them by capping/extending values or excluding them if they are genuine data errors.

4. **Data Integration:**
   - **Combining Data:** Merge the cleaned and preprocessed datasets to form a single comprehensive dataset with all necessary variables for analysis.

**Variables Dropped or Created:**
- We may create additional variables like "total revenue" by summing domestic and foreign gross revenues, as it represents a more comprehensive measure of movie success.
- Depending on the analysis and specific data questions, we might drop irrelevant variables that do not contribute to the business problem at hand.

**Addressing Missing Values or Outliers:**
- If there are only a few missing values, we may choose to impute them using appropriate methods (e.g., mean or median).
- In cases of significant missing data or when the missingness pattern is systematic, dropping rows with missing values might be a suitable approach.
- Outliers will be handled based on their impact on analysis. Mild outliers might be kept, while extreme outliers that could significantly skew results will be handled appropriately (e.g., capping/extending values or removal).

**Justification:**
- Data cleaning is necessary to ensure the accuracy and reliability of the analysis. Handling missing values and outliers appropriately prevents biased results and ensures the statistical validity of the findings.
- Standardizing titles and merging relevant information allows for comprehensive analysis, ensuring that all available data is used effectively to answer the data questions and provide valuable insights to the business problem.
- Feature engineering enhances the dataset with additional informative metrics that can further aid analysis and decision-making.
- Data integration enables a unified dataset, reducing complexity and ensuring a seamless analysis process.

The choices made in data preparation are appropriate given the data and the business problem because they enhance data quality, enable meaningful analysis, and facilitate the identification of factors influencing movie success and profitability. A well-prepared dataset will lead to more reliable and actionable recommendations for the movie production company.

In [18]:
# Here you run your code to clean the data

## Data Modeling 
**Data Modeling Process**

The data modeling process involves analyzing the data to derive insights and answer the data questions posed earlier. The primary goal is to use appropriate statistical and machine learning techniques to extract meaningful patterns and relationships from the data. Here's how the data modeling process might be conducted:

1. **Exploratory Data Analysis (EDA):** Before diving into complex modeling, perform EDA to gain an understanding of the data distribution, correlations, and potential outliers. Visualizations such as histograms, scatter plots, box plots, and correlation matrices can be used to explore the relationships between variables and identify trends.


**Justification for Data Modeling Choices**

- **EDA:** EDA provides valuable insights into data distributions and relationships, guiding feature selection and model design.

By following this data modeling process, we can gain valuable insights from the data, develop reliable models, and make data-driven recommendations to address the business problem of maximizing movie revenue and audience satisfaction.

In [19]:
# Here you run your code to model the data

## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

Questions to consider:

What would you recommend the business do as a result of this work?
What are some reasons why your analysis might not fully solve the business problem?
What else could you do in the future to improve this project?